## ✅ Terraform Plan successful
#### Terraform Plan Output
<details>
<summary>Show Output</summary>

```
aws_sqs_queue.processing_queue: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/886360753244/data-processed-queue]
aws_iam_role.lambda_role: Refreshing state... [id=lambda_processor_role]
aws_sns_topic.notifications: Refreshing state... [id=arn:aws:sns:us-east-1:886360753244:data-processed-topic]
aws_dynamodb_table.processed_data: Refreshing state... [id=processed-data]
aws_s3_bucket.data_bucket: Refreshing state... [id=serverless-arch-data-bucket]
aws_s3_bucket.lambda_bucket: Refreshing state... [id=serverless-arch-lambda-bucket]
aws_sns_topic_subscription.sns_to_sqs_sub: Refreshing state... [id=arn:aws:sns:us-east-1:886360753244:data-processed-topic:3b34f14f-00a8-4c8f-8814-9ed86444c61b]
data.aws_iam_policy_document.sqs_policy: Reading...
data.aws_iam_policy_document.sqs_policy: Read complete after 0s [id=963451197]
aws_sqs_queue_policy.queue_policy: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/886360753244/data-processed-queue]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # aws_s3_bucket.data_bucket has been deleted
  - resource "aws_s3_bucket" "data_bucket" {
      - arn                = "arn:aws:s3:::serverless-arch-data-bucket" -> null
      - id                 = "serverless-arch-data-bucket" -> null
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_s3_bucket.lambda_bucket has been deleted
  - resource "aws_s3_bucket" "lambda_bucket" {
      - id                 = "serverless-arch-lambda-bucket" -> null
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_dynamodb_table.processed_data is tainted, so must be replaced
-/+ resource "aws_dynamodb_table" "processed_data" {
      ~ arn                         = "arn:aws:dynamodb:us-east-1:886360753244:table/processed-data" -> (known after apply)
      - deletion_protection_enabled = false -> null
      ~ id                          = "processed-data" -> (known after apply)
        name                        = "processed-data"
      ~ read_capacity               = 0 -> (known after apply)
      + stream_arn                  = (known after apply)
      - stream_enabled              = false -> null
      + stream_label                = (known after apply)
      + stream_view_type            = (known after apply)
      - table_class                 = "STANDARD" -> null
      - tags                        = {} -> null
      ~ tags_all                    = {} -> (known after apply)
      ~ write_capacity              = 0 -> (known after apply)
        # (4 unchanged attributes hidden)

      ~ global_table_witness {
          + arn                         = (known after apply)
          + billing_mode                = (known after apply)
          + deletion_protection_enabled = (known after apply)
          + hash_key                    = (known after apply)
          + id                          = (known after apply)
          + name                        = (known after apply)
          + range_key                   = (known after apply)
          + read_capacity               = (known after apply)
          + region                      = (known after apply)
          + restore_date_time           = (known after apply)
          + restore_source_name         = (known after apply)
          + restore_source_table_arn    = (known after apply)
          + restore_to_latest_time      = (known after apply)
          + stream_arn                  = (known after apply)
          + stream_enabled              = (known after apply)
          + stream_label                = (known after apply)
          + stream_view_type            = (known after apply)
          + table_class                 = (known after apply)
          + tags                        = (known after apply)
          + tags_all                    = (known after apply)
          + write_capacity              = (known after apply)
        } -> (known after apply)

      ~ point_in_time_recovery {
          + arn                         = (known after apply)
          + billing_mode                = (known after apply)
          + deletion_protection_enabled = (known after apply)
          + hash_key                    = (known after apply)
          + id                          = (known after apply)
          + name                        = (known after apply)
          + range_key                   = (known after apply)
          + read_capacity               = (known after apply)
          + region                      = (known after apply)
          + restore_date_time           = (known after apply)
          + restore_source_name         = (known after apply)
          + restore_source_table_arn    = (known after apply)
          + restore_to_latest_time      = (known after apply)
          + stream_arn                  = (known after apply)
          + stream_enabled              = (known after apply)
          + stream_label                = (known after apply)
          + stream_view_type            = (known after apply)
          + table_class                 = (known after apply)
          + tags                        = (known after apply)
          + tags_all                    = (known after apply)
          + write_capacity              = (known after apply)
        } -> (known after apply)

      ~ server_side_encryption {
          + arn                         = (known after apply)
          + billing_mode                = (known after apply)
          + deletion_protection_enabled = (known after apply)
          + hash_key                    = (known after apply)
          + id                          = (known after apply)
          + name                        = (known after apply)
          + range_key                   = (known after apply)
          + read_capacity               = (known after apply)
          + region                      = (known after apply)
          + restore_date_time           = (known after apply)
          + restore_source_name         = (known after apply)
          + restore_source_table_arn    = (known after apply)
          + restore_to_latest_time      = (known after apply)
          + stream_arn                  = (known after apply)
          + stream_enabled              = (known after apply)
          + stream_label                = (known after apply)
          + stream_view_type            = (known after apply)
          + table_class                 = (known after apply)
          + tags                        = (known after apply)
          + tags_all                    = (known after apply)
          + write_capacity              = (known after apply)
        } -> (known after apply)

      ~ ttl {
          + arn                         = (known after apply)
          + billing_mode                = (known after apply)
          + deletion_protection_enabled = (known after apply)
          + hash_key                    = (known after apply)
          + id                          = (known after apply)
          + name                        = (known after apply)
          + range_key                   = (known after apply)
          + read_capacity               = (known after apply)
          + region                      = (known after apply)
          + restore_date_time           = (known after apply)
          + restore_source_name         = (known after apply)
          + restore_source_table_arn    = (known after apply)
          + restore_to_latest_time      = (known after apply)
          + stream_arn                  = (known after apply)
          + stream_enabled              = (known after apply)
          + stream_label                = (known after apply)
          + stream_view_type            = (known after apply)
          + table_class                 = (known after apply)
          + tags                        = (known after apply)
          + tags_all                    = (known after apply)
          + write_capacity              = (known after apply)
        } -> (known after apply)

      ~ warm_throughput {
          + arn                         = (known after apply)
          + billing_mode                = (known after apply)
          + deletion_protection_enabled = (known after apply)
          + hash_key                    = (known after apply)
          + id                          = (known after apply)
          + name                        = (known after apply)
          + range_key                   = (known after apply)
          + read_capacity               = (known after apply)
          + region                      = (known after apply)
          + restore_date_time           = (known after apply)
          + restore_source_name         = (known after apply)
          + restore_source_table_arn    = (known after apply)
          + restore_to_latest_time      = (known after apply)
          + stream_arn                  = (known after apply)
          + stream_enabled              = (known after apply)
          + stream_label                = (known after apply)
          + stream_view_type            = (known after apply)
          + table_class                 = (known after apply)
          + tags                        = (known after apply)
          + tags_all                    = (known after apply)
          + write_capacity              = (known after apply)
        } -> (known after apply)

        # (2 unchanged blocks hidden)
    }

  # aws_iam_policy.processor_policy will be created
  + resource "aws_iam_policy" "processor_policy" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "ProcessorPolicy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = (known after apply)
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }

  # aws_iam_policy.uploader_policy will be created
  + resource "aws_iam_policy" "uploader_policy" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "UploaderPolicy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = (known after apply)
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }

  # aws_iam_role_policy_attachment.lambda_attach will be created
  + resource "aws_iam_role_policy_attachment" "lambda_attach" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "lambda_processor_role"
    }

  # aws_lambda_function.processor will be created
  + resource "aws_lambda_function" "processor" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + function_name                  = "process-uploaded-file"
      + handler                        = "main.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + region                         = "us-east-1"
      + reserved_concurrent_executions = -1
      + role                           = "arn:aws:iam::886360753244:role/lambda_processor_role"
      + runtime                        = "python3.11"
      + s3_bucket                      = (known after apply)
      + s3_key                         = "lambda/function.zip"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags_all                       = (known after apply)
      + timeout                        = 10
      + version                        = (known after apply)

      + ephemeral_storage (known after apply)

      + logging_config (known after apply)

      + tracing_config (known after apply)
    }

  # aws_lambda_permission.allow_s3 will be created
  + resource "aws_lambda_permission" "allow_s3" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "process-uploaded-file"
      + id                  = (known after apply)
      + principal           = "s3.amazonaws.com"
      + region              = "us-east-1"
      + source_arn          = (known after apply)
      + statement_id        = "AllowExecutionFromS3"
      + statement_id_prefix = (known after apply)
    }

  # aws_s3_bucket.data_bucket will be created
  + resource "aws_s3_bucket" "data_bucket" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "serverless-arch-data-bucket"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_region               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = true
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = "us-east-1"
      + request_payer               = (known after apply)
      + tags_all                    = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule (known after apply)

      + grant (known after apply)

      + lifecycle_rule (known after apply)

      + logging (known after apply)

      + object_lock_configuration (known after apply)

      + replication_configuration (known after apply)

      + server_side_encryption_configuration (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

  # aws_s3_bucket.lambda_bucket will be created
  + resource "aws_s3_bucket" "lambda_bucket" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "serverless-arch-lambda-bucket"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_region               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = true
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = "us-east-1"
      + request_payer               = (known after apply)
      + tags_all                    = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule (known after apply)

      + grant (known after apply)

      + lifecycle_rule (known after apply)

      + logging (known after apply)

      + object_lock_configuration (known after apply)

      + replication_configuration (known after apply)

      + server_side_encryption_configuration (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

  # aws_s3_bucket_notification.bucket_notification will be created
  + resource "aws_s3_bucket_notification" "bucket_notification" {
      + bucket      = (known after apply)
      + eventbridge = false
      + id          = (known after apply)
      + region      = "us-east-1"

      + lambda_function {
          + events              = [
              + "s3:ObjectCreated:*",
            ]
          + id                  = (known after apply)
          + lambda_function_arn = (known after apply)
        }
    }

Plan: 9 to add, 0 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"
```
</details>